[net]
batch=128
subdivisions=1
width=320
height=256
channels=3
momentum=0.949
decay=0.0005
angle=0
saturation=1.5
exposure=1.5
hue=.1

learning_rate=0.001
burn_in=4000
max_batches=100020
policy=steps
steps=40000,75000
scales=.1,.1

[convolutional]
filters=8
size=3
groups=1
stride=2
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=8
size=3
groups=8
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=4
size=1
groups=1
stride=1
pad=1
batch_normalize=1
activation=linear

[convolutional]
filters=18
size=1
groups=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=18
size=3
groups=18
stride=2
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=6
size=1
groups=1
stride=1
pad=1
batch_normalize=1
activation=linear

[convolutional]
filters=36
size=1
groups=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=36
size=3
groups=36
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=6
size=1
groups=1
stride=1
pad=1
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=linear


[convolutional]
filters=18
size=1
groups=1
stride=1
pad=1
batch_normalize=1
activation=relu

[route]
layers = -8

[maxpool]
size=2
stride=2

[route]
layers = -1,10


[convolutional]
filters=24
size=1
groups=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=24
size=3
groups=24
stride=2
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=8
size=1
groups=1
stride=1
pad=1
batch_normalize=1
activation=linear

[convolutional]
filters=48
size=1
groups=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=48
size=3
groups=48
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=8
size=1
groups=1
stride=1
pad=1
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=linear


[convolutional]
filters=48
size=1
groups=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=48
size=3
groups=48
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=8
size=1
groups=1
stride=1
pad=1
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=linear
######################

[convolutional]
filters=24
size=1
groups=1
stride=1
pad=1
batch_normalize=1
activation=relu

[route]
layers = -12

[maxpool]
size=2
stride=2

[route]
layers = -1,25

[convolutional]
filters=48
size=1
groups=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=48
size=3
groups=48
stride=2
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=16
size=1
groups=1
stride=1
pad=1
batch_normalize=1
activation=linear

[convolutional]
filters=96
size=1
groups=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=96
size=3
groups=96
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=16
size=1
groups=1
stride=1
pad=1
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=linear


[convolutional]
filters=96
size=1
groups=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=96
size=3
groups=96
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=16
size=1
groups=1
stride=1
pad=1
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=linear


[convolutional]
filters=96
size=1
groups=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=96
size=3
groups=96
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=16
size=1
groups=1
stride=1
pad=1
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=linear


[convolutional]
filters=48
size=1
groups=1
stride=1
pad=1
batch_normalize=1
activation=relu

[route]
layers = -16

[maxpool]
size=2
stride=2

[route]
layers = -1,44

[convolutional]
filters=96
size=1
groups=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=96
size=3
groups=96
stride=2
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=24
size=1
groups=1
stride=1
pad=1
batch_normalize=1
activation=linear

[convolutional]
filters=144
size=1
groups=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=144
size=3
groups=144
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=24
size=1
groups=1
stride=1
pad=1
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=linear


[convolutional]
filters=144
size=1
groups=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=144
size=3
groups=144
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=24
size=1
groups=1
stride=1
pad=1
batch_normalize=1
activation=linear

[shortcut]
from=-4
activation=linear

[convolutional]
filters=96
size=1
groups=1
stride=1
pad=1
batch_normalize=1
activation=relu

[route]
layers = -12

[maxpool]
size=2
stride=2

[route]
layers = -1,59

######################################
[convolutional]
filters=72
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

#squeeze-n-excitation
[avgpool]

# squeeze ratio r=4 (recommended r=16)
[convolutional]
filters=36
size=1
stride=1
activation=relu

# excitation
[convolutional]
filters=72
size=1
stride=1
activation=logistic

# multiply channels
[scale_channels]
from=-4
#############################
[convolutional]
filters=72
size=3
groups=72
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=48
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
size=1
stride=1
pad=1
filters=18
activation=linear

[yolo]
mask = 9,10,11
anchors = 4,  6,   6,  9,   8, 13,  12, 10,  13, 19,  19, 25,  26, 42,  38, 28,  42, 60,  71, 76, 101,122, 162,163
classes=1
num=12
jitter=.1
ignore_thresh =.5
truth_thresh = 1
random=1
#################
scale_x_y = 1.0
iou_thresh=0.213
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
nms_kind=greedynms
beta_nms=0.2
###################
[route]
layers = -9

[upsample]
stride = 2

[route]
layers=-1,48

[convolutional]
filters=48
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

#squeeze-n-excitation
[avgpool]

# squeeze ratio r=4 (recommended r=16)
[convolutional]
filters=24
size=1
stride=1
activation=relu

# excitation
[convolutional]
filters=48
size=1
stride=1
activation=logistic

# multiply channels
[scale_channels]
from=-4

[convolutional]
filters=48
size=3
groups=48
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=36
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
size=1
stride=1
pad=1
filters=18
activation=linear

[yolo]
mask = 6,7,8
anchors = 4,  6,   6,  9,   8, 13,  12, 10,  13, 19,  19, 25,  26, 42,  38, 28,  42, 60,  71, 76, 101,122, 162,163
classes=1
num=12
jitter=.1
ignore_thresh =.5
truth_thresh = 1
random=1
#################
scale_x_y = 1.0
iou_thresh=0.213
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
nms_kind=greedynms
beta_nms=0.2
#############################
[route]
layers = -9

[upsample]
stride=2

[route]
layers=-1,29

[convolutional]
filters=24
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

#squeeze-n-excitation
[avgpool]

# squeeze ratio r=4 (recommended r=16)
[convolutional]
filters=12
size=1
stride=1
activation=relu

# excitation
[convolutional]
filters=24
size=1
stride=1
activation=logistic

# multiply channels
[scale_channels]
from=-4

[convolutional]
filters=24
size=3
groups=24
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=30
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
size=1
stride=1
pad=1
filters=18
activation=linear

[yolo]
mask = 3,4,5
anchors = 4,  6,   6,  9,   8, 13,  12, 10,  13, 19,  19, 25,  26, 42,  38, 28,  42, 60,  71, 76, 101,122, 162,163
classes=1
num=12
jitter=.1
ignore_thresh =.5
truth_thresh = 1
random=1
#################
scale_x_y = 1.0
iou_thresh=0.213
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
nms_kind=greedynms
beta_nms=0.2

[route]
layers = -9

[upsample]
stride = 2

[route]
layers=-1,14


#############################
[convolutional]
filters=18
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

#squeeze-n-excitation
[avgpool]

# squeeze ratio r=4 (recommended r=16)
[convolutional]
filters=9
size=1
stride=1
activation=relu

# excitation
[convolutional]
filters=18
size=1
stride=1
activation=logistic

# multiply channels
[scale_channels]
from=-4

[convolutional]
filters=18
size=3
groups=18
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=24
size=1
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
size=1
stride=1
pad=1
filters=18
activation=linear


[yolo]
mask = 0,1,2
anchors = 4,  6,   6,  9,   8, 13,  12, 10,  13, 19,  19, 25,  26, 42,  38, 28,  42, 60,  71, 76, 101,122, 162,163
classes=1
num=12
jitter=.1
ignore_thresh =.5
truth_thresh = 1
random=1
#################
scale_x_y = 1.0
iou_thresh=0.213
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
nms_kind=greedynms
beta_nms=0.2
